{
  "creators": [
    {
      "id": "c1",
      "name": "Charles Khoury",
      "slug": "charles-khoury",
      "x": 18,
      "y": 22,
      "details": "CHARLES KHOURY\n\nBiography:\nCharles Khoury (b. 1966, Beirut) is a post-war to contemporary Lebanese artist known for his vibrant, symbolic works exploring humanity and coexistence. A graduate of the Lebanese Academy of Fine Arts (ALBA) and certified in Lithography, Khoury is a member of UNESCO Paris through the International Association of Fine Arts. Since his debut in 1989, he has exhibited widely across Europe, the Middle East, Africa, and Asia, including in France, the UK, Dubai, Egypt, Lebanon, China, and beyond.\n\nInfluenced by Wassily Kandinsky, Paul Klee, and Pablo Picasso, Khoury's early works reflected Lebanon's war-torn past, later evolving into a euphoric world populated by playful animals and distorted human figures. His signature thick outlines and overlapping forms symbolize coexistence and harmony. Alongside painting, he also creates colorful wooden animal sculptures.\n\nKhoury received the Special Jury Award from Beirut's Nicolas Sursock Museum in 2008 and completed residencies in Morocco (2013) and China (2018). His work has been featured in major fairs such as Volta Basel, Art Dubai, Abu Dhabi Art, and the Beirut Art Fair.\n\nConcept Idea:\nThe chair is a reinterpretation of a previous sculpture, transformed into a functional object while keeping its sculptural qualities. It explores the translation of artistic forms into everyday use.\n\nTechnology used by Naggiar:\n- The chair's main structure was fabricated from 10 mm steel through laser cutting, bending, and welding.\n- The structure was finished in black.\n- Additional colored elements were first modeled in cardboard by the artist.\n- The elements were then replicated in powder-coated steel and later glued onto the chair.\n",
      "image": "assets/images/Charles Khoury.jpg"
    },
    {
      "id": "c2",
      "name": "Zena Assi",
      "slug": "zena-assi",
      "x": 35,
      "y": 30,
      "details": "ZENA ASSI\n\nBiography:\nBorn in Lebanon, in 1974, Zena Assi lives and works in London. The artist uses various supports and mediums to document and explore the cultural and social changes and put on record our urban contemporary environment's imprint. Her work takes shape in installation, drawing, etching, experimental animation, sculpture, ceramics and painting. Themes that are central to her vision include present-day issues, like migration and the relation between memories and people on the move.\n\nMany of her pieces are part of private collections as well as various public Institutions: Institut du Monde Arabe Museum in France, the Barjeel Foundation in the UAE, and the Academy of Fine Arts, ALBA, in Lebanon.\n\nThroughout her artistic practice, her work has won prizes including the Sunny Dupree Family Award for a woman Artist at the Summer Exhibition at the Royal Academy, London, 2020 – the Rosemary & Co Award at the SWA show, London, 2018 and the Special Jury Prize of the XXIX of the Autumn Salon of the Sursock Museum, Beirut, 2009.\n\nAssi has exhibited in solo as well as collective shows across Europe, the Middle East and the United States of America, including- Subtitled Apeal Royal College of Art (London, UK) in 2011, Artsawa gallery (Dubai, UAE) from 2008 until 2017, Espace Claude Lemand (Paris, France) in 2011 & 2021, Cairo Biennale (Cairo, Egypt) in 2010, Stephan Witschi Gallery (Zurich, Switzerland) in 2022, Tanit Gallery (Beirut, Lebanon & London, UK) in 2022, 2023, 2024 & 2025, IWM Imperial War Museum (London, UK) in 2018, IMA Institut du Monde Arabe (Paris, France) in 2021, Summer Exhibition at the Royal Academy (London, UK) in 2020, 2022, 2024 & 2025, MOCA Museum of Contemporary Art in Saoudi Arabia in 2025 and the 57th Venice Art Biennale (Venice, Italy) in 2017.\n\nwww.zenaassi.com\nza@zenaassi.com\n\nConcept Idea:\n'Anatomy of a Bloom (fig. 1)'\n\nThis flower stands as a hybrid entity (part organic, part industrial), embodying both vulnerability and strength. Inspired by the 'Still Life' genre and reframed through an urban lens, the piece reflects on dislocation and survival. Petals imprinted with Beirut's cityscape, alongside miniature war toys and self-portraits, transform the flower into a vessel of memory, conflict, and identity. Inspired by Louise Bourgeois' Maman, the flower stands alert, fragile, and strangely animate. It echoes the emotional contradictions of uprootedness and resistance. Industrial yet alive, protective yet unsettling, the work tries to dissect the anatomy of a bloom amid displacement.\n\nTitle: Anatomy of a Bloom (fig. 1)\nStainless steel and brass, 3D printing, UV printings and gun metal finish.\nYear 2025\nEdition 1/1\n\nPlease do credit:\n©Zena Assi, ©FabLab, ©Tanit gallery.\nwith all the printing material and use of any image of the artwork on social media and in the press.\n\nTechnology used by Naggiar:\n- The sculpture's main structure was fabricated using laser-cut stainless steel sheets and welded rods.\n- 3D-printed figures were produced, cast in brass, and treated through oxidation to achieve a gunmetal finish.\n- The design originated from a small mock-up made of tape and sticks.\n- The mock-up was scaled up to a full two-meter sculpture.\n- Surface imagery was applied through UV printing on stainless steel, creating intricate layers of detail.\n- Scaling the design required precise digital modeling and expert craftsmanship to maintain organic fluidity and conceal all fabrication traces.",
      "image": "assets/images/Zena Assi by Gibert Hage.jpg"
    },
    {
      "id": "c3",
      "name": "Ouisam Melhem",
      "slug": "ouisam-melhem",
      "x": 56,
      "y": 18,
      "details": "OUISAM MELHEM\n\nBiography:\nWissam Melhem, known as Ouisam, is an established Lebanese painter and sculptor whose work explores five elements: the Human, the City, the Crown, the Bird, and the Cloud, which together form his theme of the algorithm of life. His art has been exhibited globally, including at the Peoria Riverfront Museum in the USA, where one of his works became part of the permanent collection. Recent exhibitions span Lebanon, Spain, Japan, Hungary, Egypt, Turkey, Dubai and the USA, featuring solo and collective shows that blend fantasy with reality.\n\nBorn in 1974, Ouisam holds a degree in Architecture and a master's in Landscape Urbanism. He currently teaches at the American University of Beirut (AUB), the Académie Libanaise des Beaux-Arts (ALBA), Notre Dame University (NDU), and the Lebanese University.\n\nRecently, Ouisam presented a solo exhibition at The Harvard Club of New York, introducing his new concept reKUNSTruction: KUNST meaning \"art\" in German, illustrating that true reconstruction begins not with a materialistic approach, but with the profound rebuilding of human consciousness and cultural identity.\n\nViewing art as a fusion of imagination and possibility, he continues to explore contemporary themes through sketching and painting. Ouisam says, \"Art is a fantasy, a poetic consilience, a possibility of realizing a utopian vision for the coming future.\"\n\nConcept Idea:\nBel Wejj Mreyeh, or Oh Mirror Mirror\n\nThe cell phone will stop being an object and become an environment.\nIntelligence embedded will make decisions for you.\nAnd the invisible will be the most influential.\n\nThis sculpture explores how our relationship with technology has transformed human identity into a fragmented reflection of itself. The distorted mirrored boxes symbolize the way screens have become extensions of our environment, no longer just objects we use, but spaces we inhabit. Each reflection is fractured, echoing how we present ourselves online through filtered, curated versions rather than complete realities.\n\nAs artificial intelligence and embedded technologies begin to make choices on our behalf, our individuality becomes shaped by invisible systems of data and prediction. The sculpture's rigid, screen-like forms suggest both the allure and confinement of this digital existence: we see ourselves, but only through distortion.\n\nThe reflective surfaces also represent the unseen forces. The invisible becomes the most influential, algorithms, data flows, and unseen infrastructures govern our interactions and perceptions. The sculpture's reflective distortions embody this invisibility: what appears visible (our reflection) is actually an illusion, a product of unseen technological mediation. The real power lies not in what is shown, but in what operates beneath the surface.\n\nTechnology used by Naggiar:\n- The sculpture was realized through laser cutting of brushed and mirror-finish stainless-steel sheets.\n- The sheets were precisely assembled to form fragmented mirrored volumes.\n- Select surfaces were oxidized to achieve a gunmetal finish, creating tonal contrast between reflection and shadow.\n- Structural elements were welded and passivated, ensuring stability and seamless surface continuity.\n- Aluminum spheres were molded, welded, and polished to a mirror finish.\n- The spheres form floating \"cloud\" elements that interact with light and reflection.",
      "image": "assets/images/Wissam Melhem  .jpg"
    },
    {
      "id": "c4",
      "name": "Nayla Kai Saroufim",
      "slug": "nayla-saroufim",
      "x": 74,
      "y": 28,
      "details": "NAYLA SAROUFIM\n\nBiography:\nMy name is Nayla Kai Saroufim. I am a Lebanese artist currently working between Los Angeles and Beirut. I hold a degree in Illustration and Art Direction from the Académie Libanaise des Beaux-Arts (ALBA).\n\nMy artistic journey spans over two decades, reflecting my deep passion for various forms of expression.\n\nMy style is a unique fusion of mixed media, encompassing abstract and realistic elements, often drawing inspiration from pop art and diverse cultures.\n\nIn 2013, I embarked on a focused exploration of metal works, creating installations that incorporate layers of steel, copper, wood, and other elements. Through my art, I strive to transform the rugged, industrial nature of these materials into pieces that evoke poetry and contemplation.\n\nDrawing inspiration from abstract expressionism, cartoons, graffiti, and street art, my personalized technique exudes positivity and happiness.\n\nMy artwork has graced the walls of galleries worldwide and is currently showcased in prominent cities such as Los Angeles, New York, Seoul, London, Paris, Madrid, Doha, and Dubai.\n\nConcept Idea:\nThe 4 Fs: Flight. Freedom. Fearlessness. Faith.\n\nThe 4 Fs is a sculptural lighting piece inspired by four elemental forces—Flight, Freedom, Fearlessness, and Faith. Through four forms—the nest, bird, bullet, and spiral—it tells a story of fragility, resilience, and belief.\n\nThe nest is the beginning. It embodies life, nurture, and the quiet labor of building something delicate yet enduring. Within its twigs and leaves lies the memory of resilience, the will to create even in uncertain ground.\n\nFrom it rises the bird, crafted in folded metal, reaching for light. It symbolizes spirit, hope, and the boundless desire for freedom.\n\nThe bullet intrudes upon this natural harmony. Cold and unyielding, it speaks of fear, violence, and the weight of human conflict. Its presence reminds us of the fragile balance between creation and destruction.\n\nThe spiral gathers them all, turning endlessly, a symbol of movement, time, and transformation. It carries the story forward, weaving pain and beauty into one continuous rhythm.\n\nThis piece is not only a source of light but a meditation on healing, renewal, and the quiet strength found in rising beyond what once was.\n\nFor those who rise, not in comfort, but in courage.\n\nTechnology used by Naggiar:\n- The sculptural lighting piece was produced through laser cutting of multiple metals: steel for the primary red structure, brass for the dome, and stainless steel for the remaining two elements.\n- Origami-shaped birds were folded and welded—not by hand—capturing movement and delicacy through precise angular construction.\n- All components underwent welding and passivation, ensuring seamless joins and surface protection.\n- Integrated lighting and electrical systems were meticulously embedded within the structure.\n- The sculpture functions as both an object of illumination and reflection.",
      "image": "assets/images/Nayla Saroufim 02_FINAL.jpg"
    },
    {
      "id": "c5",
      "name": "Nayla Romanos Iliya",
      "slug": "nayla-romanos-iliya",
      "x": 82,
      "y": 46,
      "details": "NAYLA ROMANOS ILIYA\n\nBiography:\nNayla Romanos Iliya is a Lebanese architect and artist. Her formative years in a war-torn country, together with cross-cultural experiences in Paris, London, Hong Kong, and Dubai, have shaped her artistic journey. She worked in architecture and interior design before fully dedicating herself to sculpture in 2011. Her artistic practice explores themes of identity and social concern, merging critical subjects with a singular aesthetic, poetic yet powerful.\n\nInfluenced by her architectural background, Romanos Iliya is equally at ease working on radically different scales, from monumental public art to intimate series. Her sculptures are found in private collections worldwide, as well as in public institutions including the Institut du Monde Arabe (Paris), the American University of Beirut Museum, the Bagri Foundation, and will soon join the collection of the British Museum. She currently lives between London and Beirut.\n\nConcept Idea:\nMEMORIAL OF LIGHT\n\nMemorial of Light honors the victims of the Beirut port explosion of August 4, 2020. After five years of reflection, it acknowledges the 218 lives lost, the thousands wounded, and serves as a reminder that justice has yet to be served.\n\nAt the heart of the work, a conical mirrored surface represents the nucleus of the explosion, inviting viewers to see themselves within this history and reflect on the ongoing absence of accountability. Surrounding it, 218 illuminated brass cylinders represent the victims who lost their lives, each distinct yet part of a collective whole. Thousands of small perforations across the surface hint at the wounds inflicted—both physical and emotional—bearing silent witness to the scars left on Beirut and its people.\n\nA faint halo of light radiates softly onto the wall, evoking hope, transcendence, and the possibility of renewal amid devastation. This memorial is both tribute and call: to honor the victims and remind us all that without justice, there can be no true healing.\n\nTechnology used by Naggiar:\n- Main manufacturing techniques included laser cutting of stainless-steel and brass sheets.\n- Sheet perforation and cutting and welding of tubes were performed, with brass tubes micro-welded to sheets.\n- Additional processes involved rolling of cones and the outer dome structure.\n- Laser cutting and perforation, as well as gun perforation of stainless steel, were carried out.\n- Brass surfaces were oxidized.\n- Electrical works for integrated lighting and metal subframe fabrication were completed.",
      "image": "assets/images/Nayla Romanos ILIYA by Maher Attar.jpg"
    },
    {
      "id": "c6",
      "name": "Missak Terzian",
      "slug": "missak-terzian",
      "x": 66,
      "y": 62,
      "details": "MISSAK TERZIAN\n\nBiography:\nMissak Terzian is a Lebanese-American visual artist of Armenian descent, born in 1949 in Beirut. Known for his semi-abstract and modern abstract expressionist works, he began his artistic journey at Ecole d'Art Guvder in 1968 and graduated from the London College of Printing in 1971.\n\nHis first major exhibition took place in 1984, launching a successful career that includes participation in 148 global exhibitions. Terzian's style evolved from semi-abstract to modern geometric abstraction, with his paintings featured in prestigious collections across the world.\n\nHis works are displayed in notable institutions like the Institut du Monde Arabe in Paris and the Musée Nicolas Sursock in Beirut. Terzian's art explores themes of transcendence, spirituality, and nature, reflecting human emotions and experiences on canvas. He aims to capture the essence of time and events through his work, stating, \"As a painter, I mark time with memories and baptize them with colors,\" highlighting nature's impact on his creativity.\n\nConcept Idea:\nOlive Tree\n\nThe olive tree has always held profound significance in my life and work.\n\nIn this powerful installation, I reimagine the olive tree, monumental in scale and in stainless steel, a material of strength and permanence. Standing at three meters high, it serves as both sculpture and symbol: a monument to resilience, and a celebration of the abundance this tree offers.\n\nThe olive tree gives abundantly and asks for nothing in return, not even water, yet it gives endlessly. It bears fruit season after season, offering nourishment, sustenance, and the golden oil that has sustained civilizations for millennia. To me, it represents a silent generosity — a gift from nature that sustains body and spirit alike.\n\nBy rendering it in stainless steel, I aim to honor the eternal qualities of the olive tree—its ability to endure, nourish, and embody hope. This work is a tribute not only to the tree itself but also to the universal values it represents: resilience, peace, and the timeless bond between humanity and nature. In doing so, it honors both its physical presence and layered meaning.\n\nTechnology used by Naggiar:\n- Main manufacturing techniques included laser cutting of stainless-steel sheets (mirror and brushed finishes) for the leaves.\n- Cutting and welding of tubes and rods were performed.\n- Heating and hand molding of metal using handheld tools was used to create organic forms.\n- The primary challenge was translating the flower tree from a 2D painted canvas into a 3-meter-high sculpture.\n- The process was achieved without any fabrication drawings, relying solely on visual interpretation and craftsmanship.",
      "image": "assets/images/Missak.jpg"
    },
    {
      "id": "c7",
      "name": "Marie Munier",
      "slug": "marie-munier",
      "x": 44,
      "y": 72,
      "details": "MARIE MUNIER\n\nBiography:\nMarie Munier is a pioneering Lebanese jewelry designer who launched her eponymous label in Beirut in the early 1970s. Originally trained in interior design at the Lebanese Academy of Fine Arts, she began her artistic career as a painter before finding her true medium in jewelry — inspired by the grandeur of ancient Mediterranean civilizations.\n\nRenowned for her distinctive, handcrafted pieces that often incorporate antique elements and her signature 22kt gold dip technique, Marie has forged a legacy as a creative visionary whose work has captivated audiences in Lebanon and beyond for over five decades.\n\nToday, she continues to evolve her artistic expression, expanding into lighting sculpture with pieces that echo the graphic beauty of her jewelry. From canvas to couture, her work is a reflection of enduring passion and innovation — \"In creation, there is always evolution.\"\n\nConcept Idea:\nSUKUN, stillness, inner calm — is both the name and essence of this luminous sculpture. Crafted in brass and iron, its form moves in perpetual rotation, casting shifting shadows across the ceiling. These light traces echo the balance of opposites: presence and absence, dark and light, motion and pause.\n\nThough always in motion, SUKUN invites quiet. Its hypnotic rhythm draws the viewer inward, offering a moment of suspended time — a breath, a silence — in a world that rarely stops.\n\nTechnology used by Naggiar:\n- The piece was realized through laser cutting of 10 mm steel and 2 mm brass sheets.\n- Welding and fabrication of the steel structure were completed, including integration of a custom swivel-axis mechanism.\n- Surface treatments included polishing and mirroring of brass sheets on one side.\n- Steel elements were powder-coated, and a transparent matte lacquer was applied on brass surfaces for protection and subtle sheen.\n- The work incorporated lighting design and complete electrical integration, ensuring both functional illumination and aesthetic harmony.",
      "image": "assets/images/mariemunier.jpg"
    },
    {
      "id": "c8",
      "name": "Karen Chekerdjian",
      "slug": "karen-chekerdjian",
      "x": 26,
      "y": 64,
      "details": "KAREN CHEKERDJIAN\n\nBiography:\nKaren Chekerdjian Biography:\nFrom Beirut's film sets to Milan's design studios, Karen Chekerdjian has always followed her curiosity. She earned her Master's in Industrial Design at Domus Academy, in 1997, where she created Mobil, her first piece for Edra under the mentorship of Massimo Morozzi.\n\nRejecting following one single direction, Chekerdjian intersects art, design, and space, questioning how furniture can impact not only the course of our daily life but also the tracks that we leave behind.\n\nExhibited in many different exhibitions such as Sfeir-Semler Gallery, Milan Furniture Fair, Design Miami and Paris's Institut du Monde Arabe, she continuously reinvents her practice, dissecting each project to give a meaning through form and function.\n\nHer studio in Beirut works on limited‐edition projects, custom commissions, and collections of furniture.\n@karenchekerdjian.design.\n\nConcept Idea:\nBomber Console\n\nThe Bomber Console gets its form from the simple idea of balance and aerodynamics. Made from brass, its structure is defined by precision cut sheets joined with exposed rivets. The piece takes its name from its wing-like top, referencing movement and lift while maintaining a strong, sculptural sense. Its design reflects a clear influence from Karen Chekerdjian's approach where industrial techniques meet refined forms.\n\nTechnology used by Naggiar:\n- \"Bomber Console\" is a stainless steel structure clad in brass sheets.\n- The brass sheets were shaped and detailed through laser cutting, rolling, and brushing.\n- Sheets were secured using stud welding, with all studs fabricated in-house via CNC milling.\n- Surfaces were finished with lacquering to enhance durability and bring out metallic tones.\n- Advanced fabrication techniques combined with handcrafted precision transform industrial materials into a refined architectural form, balancing the tactile warmth of brass with the strength of steel.",
      "image": "assets/images/Karen's portrait by alain sauma 1 (1).jpg"
    },
    {
      "id": "c9",
      "name": "Joseph El Hourany",
      "slug": "joseph-el-hourany",
      "x": 16,
      "y": 46,
      "details": "JOSEPH HOURANY\n\nBiography:\nJoseph El Hourany is a Lebanese architect (M.Arch, 1999) and urban planner (MS, 2005), also holding degrees in philosophy (BA, 2003) and musicology (BA, 2007). From 2006 to 2010, he conducted doctoral research at MIT in collaboration with the University of Quebec in Montreal, focusing on parametric architectural principles in the age of cybernetics. Since 1999, he has worked on numerous architectural and urban planning projects in Lebanon and abroad, while teaching and lecturing at various institutions. His publications include The Future of the Past (2003), Specimen Zero (2010), Specimen One (2011), Guvder (2012), and Henri Edde Architecte Moderne (2019). His artwork has been exhibited internationally, including in Montreal, Boston, and Beirut. He was elected on 2023 as president of the \"Arab Architects Association\".\n\nEl Hourany's sculptural practice explores the interplay between concept and material, often through procedural experimentation. His works resist categorization, embracing fluid forms, hybrid geometries, and non-hierarchical structures. Influenced by biomorphism, deconstruction, and ritualistic aesthetics, his sculptures reflect a continuous transformation —blurring the lines between the abstract and the figurative, the intellectual and the sensate.\n\nConcept Idea:\nTaking a compositional, minuscule breakdown, the portrait is evidently built from forms inscribed within a rectangle and/or an ellipse. After all, my initial intention was to create new head. This is composed of multiple intermediate forms meant to evoke what is natural. My methodology, as an architect, was as follows: if I compose and then combine a hundred such forms, I could produce a realistic portrait — but that is not my intention.\n\nTechnology used by Naggiar:\n- The 2-meter-high sculpture was realized from a 20 cm hand-carved wooden piece through 3D scanning.\n- Drawings were retraced to create surfaces, which were then flattened into 2D planes.\n- Laser cutting, bending, and laser welding were performed on stainless steel, followed by passivation.\n- The main challenge was accurately translating the small wooden original into a full-scale stainless steel structure.\n- Special care was taken to preserve the artist's intricate details.",
      "image": "assets/images/Joseph El Hourany .jpg"
    },
    {
      "id": "c10",
      "name": "Ihab Ahmad",
      "slug": "ihab-ahmad",
      "x": 52,
      "y": 44,
      "details": "Ihab Ahmad\n\nBiography:\nIhab Ahmad is a Lebanese artist and architect known for his unique blend of traditional and modern techniques in his artwork. He is a graduate of the American University of Beirut and the Lebanese University, where he studied architecture and art. He is also a graduate of the University of California, Berkeley, where he studied architecture and art.\n\nAhmad's artwork is known for its use of traditional techniques such as painting and sculpture, as well as modern techniques such as digital art and 3D printing. He is also known for his use of traditional materials such as wood and metal, as well as modern materials such as plastic and paper.\n\nAhmad's artwork has been exhibited in many galleries and museums around the world, including the Museum of Modern Art in New York, the Louvre in Paris, and the Metropolitan Museum of Art in London.\n\nAhmad's artwork is known for its use of traditional techniques such as painting and sculpture, as well as modern techniques such as digital art and 3D printing. He is also known for his use of traditional materials such as wood and metal, as well as modern materials such as plastic and paper.\n\nAhmad's artwork has been exhibited in many galleries and museums around the world, including the Museum of Modern Art in New York, the Louvre in Paris, and the Metropolitan Museum of Art in London.\n\nAhmad's artwork is known for its use of traditional techniques such as painting and sculpture, as well as modern techniques such as digital art and 3D printing. He is also known for his use of traditional materials such as wood and metal, as well as modern materials such as plastic and paper.\n\nAhmad's artwork has been exhibited in many galleries and museums around the world, including the Museum of Modern Art in New York, the Louvre in Paris, and the Metropolitan Museum of Art in London.\n\nConcept idea:\nMeasuring 2x1 meters, this colored iron tabletop is composed of small pieces assembled together to form a harmonious surface. The legs feature three key symbolic elements that the artist often uses in his work, the crown, the house, and the eye.In this artistic table, Ihab Ahmad invites the viewer to engage with his magical world, where beauty and harmony are expressed through playful elements that whisper stories\n\nTechnology used by Naggiar:\n- The table was constructed with a 5 mm steel top frame.\n- Each of the more than 250 colored elements was laser-cut and powder-coated separately.\n- The elements were mechanically fixed to the main frame.\n- The legs incorporate the artist’s signature symbols—a crown, an eye, and a house—providing structural support and artistic identity",
      "image": "assets/images/Ihab Ahmad.jpg"
    },
    {
      "id": "c11",
      "name": "Ghazi Baker",
      "slug": "ghazi-baker",
      "x": 50,
      "y": 50,
      "details": "GHAZI BAKER\n\nBiography:\nGhazi Baker (b. 1967, Beirut, Lebanon) is a self-taught visual artist and practicing architect based in Beirut, where he also operated his own architectural firm. Born into a multicultural family of Iranian and Armenian descent, Baker draws from a wide range of cultural and intellectual influences, shaping a body of work that is both cerebral and intuitively expressive.\n\nHis style is a vivid fusion of post-structuralist thought, dynamic line work, and deliberately anti-thematic compositions—often described as a kind of \"visual jazz.\" Baker's influences span comic book aesthetics, esoteric symbolism, motorcycle culture, and the human condition. Philosophers such as Jacques Derrida and Michel Foucault intersect in his process with visual references to Francis Bacon, Egon Schiele, and the raw, fragmented energies of contemporary life.\n\nBaker's work has been featured in major international art fairs, including Miami Art Fair (2024), Palm Beach Modern + Contemporary (2025), and the Korean International Art Fair (2024). In 2022, he participated in a collective exhibition at the Rijksmuseum in Amsterdam, further cementing his position on the global art stage. His paintings are part of significant private and institutional collections across Beirut, Dubai, New York, Paris, and other global cities.\n\nWith a practice that straddles architecture, abstraction, and subculture, Baker continues to challenge viewers with a visual language that is as intellectual as it is instinctive.\n\nEducation:\nBachelor of Architecture, BArch\nAmerican University of Beirut, 1991\n\nConcept Idea\n\nIn an age where nature is redesigned rather than revered, \"Flora Mechanica\" grows from metal, not soil, it blooms out of a steel, split open heart. It is a flower reverse-engineered — an artificial organism that blossoms through calculation, pressure, and precision. The work borrows the elegance of botanical anatomy but replaces biology with a language of fabrication: laser-cut veins, screwed stems, and petals polished into reflective circuits. It stands as both a eulogy and a celebration — a synthetic bloom cultivated in technology's garden.\n\nThe alternating layers of brushed stainless steel, red, and blue surfaces pulse with mechanical vitality, echoing arteries re-coded into architecture. Depth and shadow animate the sculpture like respiration, but there is no breath — only reflection and resistance. This is a flower that feeds on attention, not light; a product of human obsession with order disguised as life.\n\nFlora Mechanica operates as a paradox: a form of nature rebuilt by the same systems that dismantled it. It questions what remains of beauty when growth is programmed, and what kind of life emerges when design replaces instinct. Between seduction and satire, the sculpture offers a post-human specimen — resilient, immaculate, and perfectly artificial.\n\nTechnology used by Naggiar:\n- \"Flora Mechanica\" was realized through laser cutting, milling, welding, and passivation of brushed stainless steel.\n- Multi-layer powder coating was applied to achieve structural integrity and a vibrant, reflective surface.\n- Each layer was carefully assembled and treated to ensure precision in the veins, stems, and petals.\n- The fabrication techniques maintained the sculpture's mechanical vitality while presenting a seamless, polished finish.\n- The work embodies the tension between nature's fragility and technological exactitude.\n",
      "image": "assets/images/Ghazi Baker .jpg"
    }
  ]
}